
// Находим минимальное положительное целое число, которого нет в списке. 
Если список содержит только отрицательные числа, верните 1. 
Все элементы являются целыми числами:
Пример: [1,2,3,4,6] - Ответ 5
Пример: [1,2,3] - Ответ 4
Пример: [-1, -2, -6] - Ответ 1
'''


"""
Попросить пользователя ввести текст. В результате вывести процент букв 
в верхнем регистре (заглавные) и в нижнем регистре (прописные).
"""



"""
"Аналог шифра цезаря ". Программа должна запрашивать элементы списка через пробел. 
После чего пользователь должен ввести значение для сдвига элементов списка. 
Значение может быть как положительным, так и отрицательным. Если значение положительное, 
элементы списка должны сдвигаться вправо, если отрицательное - влево. Результат необходимо вывести на экран:
Введенные данные: [5,7,9,10,2], 2
Результат:        [9,10,2,5,7]
"""


"""
"Напишите функцию которая принимает в себя словарь где ключи это номера а значения страны. Попросите пользователя ввести страну или ключ и выдайте ему результат."
d = {'1': 'kyrgyzstan', '2': 'kazahstan'}
"""



"""
'С помощью рекурсии выведите числа фибоначи'
"""

"""
'С помощью рекурсии выведите факториал'
"""

"""
'С помощью рекурсии выполните перевод числа в двоичную систему счисления'
"10 - 1010"
"12 - 1100"
"3 - 11"
"15 - 1111""
"""

"""
'Найдите длину списка при помощи рекурсии'
"""