
# Нужно создать класс который принимет данные в формате dict. Эти данные, вы сможете взять из Classroom Data #1.
# Вам нужно создать 6 методов класса:
# Получить все ключи в TUPLE.
# Получить все значения в TUPLE.
# Получить все ключи в LIST.
# Получить все значения в LIST.
# Получить все ключи в SET.
# Получить все значения в SET.

# Ниже когда вы будете передавать Словарь классу он и вызывать из него любой метод Вы должны получать 
#соответсвенно нужные типы данных.
# Example: my_class = Parser("DICT") | my_class.get_keys_tuple()

Data #1:
colors = {
"black": {
"category": "hue",
"type": "primary",
"code": {
"rgba": [255,255,255,1],
"hex": "#000"
}

