
#Задание 3:
  #  Пользователь вводит сторону квадрата. Найдите периметр и площадь квадрата.
#==============================================================================

a = int(input("введите любую сторону для квадрата :"))
z=a*a
s=4*a
print('площадь квадрата',z)
print('периметр квадрата',s)