
# Создайте функцию которая принимает Имя пользователя и его зарплату и возвращает это строкой как: 
# ИМЯ - ЗАРПЛАТА. Если в функции не была указана зарплата - подставьте её сами. Значение по умолчанию - 5000.


def salary():
    print(a,b)
a = input('Enter name: ')
b = input("Enter income: ")

salary()
