# Напишите функцию которая спрашивает у пользователя число и выводит ему на экран 
# именно столько строк самой себя как текст.



# def rep():
# 	a = int(input("Ведите число: "))
# 	for x in range(a):
# 		print(str(a))

# rep()

# def rep():
# 	a = input("Enter a word: ")
# 	for x in range(a):
# 		return x
# 		# print(x)

# print(rep())


